Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В таблице представлено описание столбцов, которые должны содержаться во внешнем разбиении для непрерывного и дискретного разбиения соответственно:
en: The columns that must be included into the external binning for the continuous and discrete binning correspondingly are described in the table:

source: В таком случае данные поступают в основной алгоритм без предварительной обработки.
en: In this case, the data is sent to the main algorithm without preprocessing.

source: В таком случае разбиение берется из таблицы, а не рассчитывается алгоритмом на основе текущих данных.
en: In this case, the binning is taken from the table, and it is not calculated using the algorithm based on the current data.

source: В тексте SQL-запроса можно использовать Управляющие переменные в качестве параметров и макроподстановок, что позволяет динамически формировать запрос, отправляемый на сервер.
en: It is allowed to use Control variables in the SQL query text as parameters and macro substitution. It allows for dynamic generation of the request sent to the server.

source: В тексте запроса ее необходимо обрамлять знаками процента, например %condition%.
en: It must be marked with percent signs in the query text, for example, %condition%.

source: В тексте запроса параметр записывается со знаком двоеточие, например :var1.
en: The parameter is written with a colon in the query text, for example: :var1.

source: В теле скрипта можно использовать ссылки на другие поля или переменные Калькулятора, в том числе новые, созданные в списке выражений.
en: It is possible to use references to other Calculator fields or variables created in the expressions list, including the new ones.

source: В терминах многомерной модели данных такое подмножество называется срезом.
en: Such subset is called a slice in the terms of the multidimensional data model.

source: В то же время автоматический способ гораздо быстрее и хорошо подходит при незначительных изменениях в исходных данных.
en: At the same time, the automatic method is much faster and it is well-suited when the changes in the source data are insignificant.

source: В третьем случае строки входного набора разделяются по заданному признаку на группы строк, и в каждой итерации на вход узла, заключенного в цикл, подаются строки очередной группы.
en: In the third case, the input data set rows are divided according to the given parameters to the groups of rows, and the rows of the next group are supplied to the looped node input for each iteration.

source: В узлах компонентов Калькулятор (переменные) и Таблица в переменные.
en: in the following components nodes: Calculator (variables) and Table to variables.

source: В факторном анализе речь идет о выделении из множества измеряемых характеристик объекта факторов, более емко отражающих свойства объекта.
en: Within the framework of the factor analysis, it is required to select the factors that provide more comprehensive overview of the object properties from a set of measured object features.

source: В формуле выражения возможно использовать только выражения, находящиеся выше по списку.
en: It is allowed to use only the expressions that are higher in the list in the expression formula.

source: В целях совместимости импорт созданных в Deductor DDF-файлов поддерживается.
en: To provide compatibility, import of the DDF files created in Deductor is supported.

source: В этих случаях целесообразно сохранить промежуточные расчеты в памяти для последующего использования.
en: In these cases it is reasonable to save the intermediate calculations in the memory for the further use.

source: В этой области отображаются результаты квантования с возможностью их редактирования. Над полями таблицы расположены несколько элементов управления:
en: The binning results that can be edited are displayed in this area. Several control elements are located over the table fields:

source: В этом же окне выводится текущее настроенное отображение:
en: The current configured view is also shown in this window:

source: В этом подразделе происходит создание пользователей, их редактирование, распределение прав, выбор способа их аутентификации и удаление.
en: This subsection enables to create users, edit them, distribute rights, select their authentification method and delete them.

source: В этом случае будут деактивированы все узлы находящиеся перед узлом с отчетом и активированы снова.
en: In this case, all nodes located before the node with the report will be deactivated and activated again.

source: В этом случае в поле параметра пользователь выбирает переменную, содержащую значение параметра.
en: In this case, a user selects the variable that contains the parameter value in the parameter field.

source: В этом случае входные данные узла не могут быть сформированы, а это означает, что узел не может быть выполнен.
en: In this case, the input node data cannot be generated, and it means that the node cannot be executed.

source: В этом случае выбирают столько факторов, чтобы в сумме они объясняли не менее 70-75% дисперсии.
en: In this case, it is required to select the number of factors that in sum would enable to explain not less than 70-75% of variance.

source: В этом случае выходная таблица будет иметь вид:
en: In this case, the output table will be as follows:

source: В этом случае выходной набор данных содержит единственную запись.
en: In this case, the output data set contains the only record.

source: В этом случае выходной набор данных содержит количество записей, равное количеству уникальных значений идентификатора.
en: In this case, the output data set contains the number of records that is equal to the count of unique identifier values.

source: В этом случае выходной набор данных содержит такое же количество записей, что и во входной таблице.
en: In this case, the output data set contains the same number of records as the input table does.

source: В этом случае данную колонку необходимо свети к одному значению с помощью методов агрегации.
en: In this case, it is important to set the column to one value using the aggregation methods.

source: В этом случае для задания порядка выполнения узлов применяют служебные порты (см.
en: In this case, to set the nodes execution order, the service ports are used (refer to

source: В этом случае для сопоставления можно выбрать два различных интерфейса:
en: In this case, it is possible select two different interfaces for mapping:

source: В этом случае для формирования произвольной структуры запроса/ответа в качестве портов Подмодели удобно использовать порты типа Дерево данных с возможностью задать структуру данных XSD-схемой, т.е. использовать тот же механизм, что и в Deductor Integration Server.
en: In this case, to provide the request/response random structure, it is convinient to use as the Supernode ports the ports of the Data tree type that enable to set the data structure by the XSD schema, namely, to use the same mechanism that is used in Deductor Integration Server.

source: В этом случае значения имен полей не важны, однако типы данных по-прежнему должны совпадать.
en: In this case, values of the fields names are not important. However, data types must still coincide.

source: В этом случае имена полей не важны, однако типы данных должны совпадать.
en: In this case, fields names are not important. However, data types must still coincide.

source: В этом случае на панели инструментов появляется кнопка с выпадающим списком, в котором будут находиться все не поместившиеся на панели кнопки.
en: In this case, button with a drop-down list appears on the toolbar. It will contain all other buttons for which there is no enough place on the toolbar.

source: В этом случае необходимо следить за локальными настройками.
en: In this case, it is required to keep track of the local settings.

source: В этом случае отчет добавится в список "Без группы".
en: In this case, the report will be added to "Without group" list.

source: В этом случае при запуске мастера настройки первым открывается окно настройки входных диапазонов, где нужно установить соответствия между столбцами.
en: In this case, when starting the wizard, the input range configuration window will be opened first. It will be required to provide columns mapping there.

source: В этом случае приведенный выше пример будет выглядеть следующим образом:
en: In this case, the example provided above will be as follows:

source: В этом случае узел будет связан с одним их входных узлов с таким же именем и типом данных.
en: In this case, the node will be linked to one of their input nodes with the same name and data type.

source: В этом случае цикл будет перебирать строки входного набора и передавать очередную строку на вход узла, заключенного в цикл.
en: In this case, the loop will iterate over the input data rows, and then it will transfer the next row to the looped node input.

source: В ячейках полей указаны веса узлов сети.
en: Weights of the network nodes are specified in the field cells.

source: В ячейках такой таблицы содержатся элементы данных: строки, числа, даты, логические значения.
en: Cells of such table contain the data items: rows, numbers, dates, logical values.

source: ВЫБРАТЬ КурсыВалют.Валюта.Код, КурсыВалют.Валюта.Наименование, КурсыВалют.Период КАК Период, КурсыВалют.Курс, КурсыВалют.Кратность ИЗ РегистрСведений.КурсыВалют КАК КурсыВалют ГДЕ КурсыВалют.Период МЕЖДУ &start_date И &end_date УПОРЯДОЧИТЬ ПО Период УБЫВ
en: SELECT CurrencyRates.Currency.Code, CurrencyRates.Currency.Name, CurrencyRates.Period AS Period, CurrencyRates.Rate, CurrencyRates.Multipleness FROM RollupLedger.CurrencyRates AS CurrencyRates WHERE CurrencyRates.Period BETWEEN &start_date AND &end_date ORDER BY DESC period

source: Валидация не производится.
en: Validation is not performed.

source: Варианты активации узла
en: Node Activation Options

source: Варианты валидации
en: Validation Options

source: Варианты нормализации данных в Loginom:
en: The following data normalization options are available in Loginom:

source: Варианты результирующей таблицы из примера с разными Способами обработки неполных записей.
en: The resulting table options from the example with different Incomplete records processing methods.

source: Варианты слияния наборов:
en: Options of data sets join:

source: Ввести нужное количество кластеров (должно быть больше 2).
en: Enter the required number of clusters (must exceed 2).

source: Ввод параметров подключения вручную, параметры в строке указываются через двоеточие.
en: When parameters are manually entered, it is required to provide the colon separated parameters in the string.

source: Вводится строка токена.
en: The token string is entered.

source: Веб-сервисы Loginom имеют следующую особенность: XML ответов и запросов веб-сервисов в своей структуре могут иметь элемент <PortName> (элемент содержит имя порта), отсутствующий в веб-сервисах DIS.
en: The Loginom web services are distinguished by the following peculiarity: XML responses and requests of web services can have the following item in their structure: <PortName> (the item contains the port name). It is not available in the DIS web services.

source: Веб-сервисы:
en: Web Services:

source: Вейвлет-сглаживание - тип вейвлета определяется радиокнопкой: Добеши, Койфлеты, CDF 9/7.
en: Wavelet smoothing: the wavelet type is defined by the radio button (Daubechies, Coiflet and CDF 9/7).

source: Величина связи между переменными регрессионной модели (изменяется от 0 до 1)
en: Value of link between variables of regression model (changes from 0 to 1)

source: Величина связи между переменными регрессионной модели (изменяется от 0 до 1).
en: Value of link between variables of regression model (changes from 0 to 1)

source: Величина, используемая для оценки точности критерия Вальда
en: The value used for assessment of the Wald criterion accuracy.

source: Величина, определяющая значимость признака в модели бинарной классификации
en: The value that defines the indicator significance in the binary classification model

source: Величина, показывающая отношение вероятности того, что событие произойдет к вероятности того, что событие не произойдет
en: The value that shows probability ratio of the fact that the event will occur to the probability of the fact that the event will not occur.

source: Вероятность - вероятность, связанная с гамма-распределением.
en: Probability - the probability connected with gamma distribution.

source: Вероятность события|Прогноз.
en: Event probabillity|Prediction.

source: Версии 3.0 и выше.
en: Versions 3.0 and higher.

source: Версии 95, 97, 2000, 2003, 2007, 2010, 2013 и 2016.
en: Versions 95, 97, 2000, 2003, 2007, 2010, 2013 and 2016.

source: Версии БД ClickHouse 19.1 и выше.
en: DB versions of ClickHouse 19.1 and higher.

source: Версии от 8.0 до 10.0.
en: Versions from 8.0 to 10.0.

source: Версия пакета
en: Package version

source: ВерхнийРегистр - аргумент логического типа, определяющий регистр символов шестнадцатеричных цифр.
en: UpperCase - argument of the logical type defining the character case of hexadecimal digits.

source: Верхнюю границу — верхняя граница самого высокого интервала;
en: Upper bound — upper bound of the highest bin.

source: Верхняя
en: Upper

source: Верхняя граница
en: Upper bound

source: Верхняя граница ДИ
en: CI upper bound

source: Верхняя граница включена
en: Include upper bound

source: Верхняя граница диапазонов открыта
en: Upper bin bound open

source: Верхняя граница доверительного интервала
en: Upper bound of confidence interval

source: Верхняя граница интервала
en: Upper bin bound

source: Верхняя граница открыта
en: Upper bound open

source: Верхняя часть отображает вкладки открытых пакетов, содержит адресную строку и элементы для навигации по пакетам и их составляющим.
en: The upper part displays tabs of the opened packages. It contains address line and navigation elements for packages and their parts.

source: Верхняя часть панели содержит единственную настройку гистограммы в дополнении к общим настройкам гистограмм на Панели инструментов:
en: The upper panel part contains the only histogram setting added to the general histogram settings on the Toolbar:

source: Вес доказательства
en: Weight of evidence

source: Вес класса — это отношение числа наблюдений, для которых значение входного признака попадает в данный класс, к общему числу наблюдений исходного набора данных.
en: Class weight means the ratio of observations count for which the input indicator value is included into this class to the total count of the initial data set observations.

source: Вес, кг
en: Weight, kg

source: Вес, кг (Количество)
en: Weight, kg (Number)

source: Вес, кг (Среднее)
en: Weight, kg (Mean)

source: Вес, кг (Сумма)
en: Weight, kg (Sum)

source: Ветви проверяются на истинность последовательно по списку сверху вниз, начиная с самой первой;
en: The branches are successively tested for authenticity from the top of the list downwards starting from the first one.

source: Вещественные числа (с плавающей точкой) отображаются с двумя знаками после десятичного разделителя, данные в формате Дата/время отображаются без указания секунд.
en: Real numbers (with floating point) are displayed with two places after decimal separator. The data in the date/time format is displayed without seconds.

source: Вещественные числа (с плавающей точкой) отображаются с двумя знаками после десятичного разделителя.
en: Real numbers (with floating point) are displayed with two places after decimal separator.

source: Вещественный/целый
en: Real/integer

source: Взаимодействие с веб-сервисом осуществляется при помощи его методов.
en: Interaction with web service is performed using its methods.

source: Вид данных
en: Data kind

source: Вид данных входных полей не регламентируется, они могут быть как непрерывными, так и дискретными.
en: Data kind of input fields is not regulated, they can be both continuous and discrete.

source: Вид данных входных полей не регламентируется.
en: Data kind of input fields is not regulated.

source: Вид данных;
en: Data kind

source: Видимость столбца можно изменить с помощью кнопки Показывать null столбец в гистограммах Показывать null столбец в гистограммах на Панели инструментов.
en: Column visibility can be changed using Show null column in histograms Show null column in histograms button on the Toolbar.

source: Видимость столбца можно изменить с помощью кнопки Показывать столбец "Прочие" в гистограммах Показывать столбец "Прочие" в гистограммах на Панели инструментов.
en: Column visibility can be changed using Show "Other" column in histograms Show "Other" column in histograms on the Toolbar.

source: Видимость узлов
en: Visibility of Nodes

source: Видом.
en: Kind

source: Виды портов узлов сценария:
en: Types of ports of the workflow nodes:

source: Визуализатор Отчет по регрессии для компонента Логистическая регрессия отображает статистические параметры и результаты статистических тестов для анализа регрессионных моделей.
en: Regression report visualizer of the Logistic Regression component displays the statistical indicators and results of the statistical tests for the regression models analysis.

source: Визуализатор Отчет по регрессии компонента Линейная регрессия отображает параметры и результаты статистических тестов для анализа регрессионных моделей.
en: Regression report visualizer of the Linear regression component displays parameters and results of the statistical tests for the regression models analysis.

source: Визуализатор Профили кластеров предназначен для просмотра различных статистических показателей кластеров, просмотра структуры кластеров и сравнения их между собой.
en: Cluster profiles visualizer is designated for view of different statistical indicators of clusters, cluster structure and their comparison with each other.

source: Визуализатор Статистика предназначен для просмотра различных статистических показателей по каждому полю набора данных и представляет собой таблицу, в которой наименования полей набора данных расположены в строках, а наименования статистических показателей в столбцах.
en: Statistics visualizer is designated for view of different statistical indicators by each data set field, and it represents the table in which the data set fields names are located in rows and names of statistical indicators are located in columns.

source: Визуализатор Конечные классы предназначен для следующих задач:
en: The Coarse Classes handler enables to solve the following problems:

source: Визуализатор включает в себя:
en: The visualizer includes the following items:

source: Визуализатор разделен на 3 области:
en: The visualizer is divided into 3 areas:

source: Визуализаторы:
en: Visualizers:

source: Включает следующие группы параметров:
en: It includes the following groups of parameters:

source: Включает список флагов, позволяющих выбрать коэффициенты для оценки корреляции:
en: It includes the list of checkboxes that enable to select coefficients for correlation estimation:

source: Включает три настройки:
en: It provides three settings:

source: Включать в себя подпрограммы — Подмодель.
en: It can include subprograms — the Supernode.

source: Включение флага означает, что на втором М-шаге алгоритма моментные оценки максимального правдоподобия заменяются более устойчивыми оценками медианного типа.
en: Selection of the checkbox means that moment scores of the maximum likelihood at the second M-step of the algorithm are replaced with more stable scores of the median type.

source: Включить Null-значения в гистограмму (в случае, если поле дискретного типа).
en: Include Null values into the histogram (for the discrete field).

source: Включить верхние границы интервала — верхнее значение границы будет включено в текущий интервал.
en: Include upper bin bounds: the upper bound value will be included into the current bin.

source: Включить отображение исходных узлов можно с помощью кнопки панели инструментов области построения Сценариев.
en: It is possible to enable display of the source nodes by toolbar button of the Workflow construction area.

source: Включить отображение родительского узла можно кнопкой панели инструментов области построения Сценариев.
en: It is possible to enable display of the parent node by toolbar button of the Workflow construction area.

source: Влияет на выбор конкретного метода и его настроек по шкале Точность — Скорость.
en: It has an impact on selection of the particular method and its settings according to the Accuracy - Speed scale.

source: Влияет на использование следующих блоков параметров: если включена, то можно настраивать блок Приоритет автоматической настройки, если выключена, то можно выбирать алгоритм отбора факторов и защиту от переобучения и настраивать приоритеты.
en: It has an impact on usage of the following packs of parameters: if it is enabled, it is possible to configure Auto setup priority pack, if it is disabled, it is possible to select the algorithm of factors selection and protection against overfitting, and it is also possible to set priorities.

source: Вложенность подмоделей друг в друга не ограничена.
en: Nesting of supernodes inside each other is not limited.

source: Вначале производится поиск и замена по точному совпадению со значениями, указанными в таблице замен;
en: First of all, it is required to search and replace by the exact match with the values specified in the replacement table.

source: Внесенные изменения вступают в силу после нажатия кнопки Сохранить.
en: The introduced changes take effect upon pressing Save button.

source: Внесенные изменения вступают в силу после перезапуска службы сервера.
en: The introduced changes take effect after the server service restart.

source: Внешние диапазоны квантования (таблица данных).
en: External binning ranges (data table).

source: Внешние модули могут быть в кодировке UTF-8 или UTF-16 Little Endian с BOM.
en: The external modules can be represented in UTF-8 or UTF-16 Little Endian с BOM encoding.

source: Внешний модуль "./foo/foo.js":
en: "./foo/foo.js" external module:

source: Внешний модуль "./foo/module/module.js":
en: "./foo/module/module.js" external module:

source: Внешний модуль "child_module.js":
en: "child_module.js" external module:

source: Внутреннее соединение (INNER JOIN) первой и второй таблиц;
en: Inner join (INNER JOIN) of the first and second tables.

source: Внутренний
en: Internal

source: Внутренний (доступен только внутри текущего Пакета);
en: Public (available only in the current Package);

source: Внутри Подмодели имеется возможность использовать Переменные сценария, в состав которых входят Переменные пользователя.
en: It is possible to use the Workflow variables that include User variables inside the Supernode.

source: Внутри компонентов подключенного Пакета могут встречаться повторяющиеся фрагменты.
en: Recurring fragments can occur in the components of the connected Package.

source: Внутри порта (см.
en: Inside the port (refer to

source: Внутри порта возможно произвести следующие изменения структуры данных:
en: It is possible to introduce the following changes of the data structure in the port:

source: Во вкладке Измерения доступны опции форматирования заголовков измерений.
en: Options of dimensions captions formatting are available in the Dimensions tab.

source: Во вкладке Факты доступны следующие опции форматирования:
en: The following formatting options are available in the Measures tab:

source: Во внешних модулях относительный путь указывается от расположения модуля, осуществляющего импорт.
en: The relative path in the external modules is specified from the import module location.

source: Во всех прочих случаях: "ЛЮБАЯ СТРОКА" приводится к null, в том числе и "" (пустая строка).
en: In all other cases: "ANY STRING" is set to null, including "" (empty string).
